{
    "attn_mode": "chunk",
    "bos_token_id": 151643,
    "clamp_min": null,
    "conv_size": 4,
    "elementwise_affine": true,
    "eos_token_id": 151643,
    "expand_k": 1,
    "expand_v": 1,
    "feature_map": "relu",
    "fuse_cross_entropy": false,
    "fuse_norm": false,
    "hidden_act": "silu",
    "hidden_ratio": 4,
    "hidden_size": 3584,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "max_position_embeddings": 131072,
    "model_type": "gla",
    "norm_eps": 1e-06,
    "num_heads": 28,
    "num_hidden_layers": 28,
    "num_kv_heads": 4,
    "tie_word_embeddings": false,
    "transformers_version": "4.44.0",
    "use_cache": true,
    "use_gk": true,
    "use_gv": false,
    "use_output_gate": false,
    "use_short_conv": false,
    "vocab_size": 152064
  }
  